Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadFailure/FileUploadFailure.*.resx
Languages: cy

# file_not_uploaded
source: Packaging data file not uploaded
cy: Ffeil data pecynwaith heb ei uwchlwytho

source: Error
cy: Gwall

# your_data_file_has_not_been_uploaded
source: Your data file has not been uploaded to your organisation’s account. This is because some of the data in your file is missing or incorrect.
cy: Mae’ch ffeil data heb gael ei huwchlwytho i gyfrif eich sefydliad, a hynny am fod rhywfaint o’r data yn eich ffeil ar goll neu yn anghywir.

# download_error_report
source: Download your error report (CSV, maximum {0})
cy: Lawrlwythwch eich adroddiad gwallau (CSV, {0} ar y mwyaf)

# pageTitle
source: File Upload Failure
cy: Wedi methu uwchlwytho’r ffeil

# your_error_report_only_show_first_x_errors
source: The error report only shows the first {0} errors in the file you uploaded. If there are more errors, you may get another error report when you upload your file again.
cy: Mae’r adroddiad gwallau yn dangos y {0} cyntaf o wallau yn unig yn y ffeil a uwchlwythwyd gennych. Os oes mwy o wallau, efallai y cewch chi adroddiad gwallau arall wrth uwchlwytho’ch ffeil eto.

# you_should_correct_these_errors
source: You should correct these errors and re-upload. If there are more errors, you may get another error report when you re-upload the file.
cy: Dylech gywiro’r gwallau hyn ac ail-uwchlwytho’r ffeil. Os bydd rhagor o wallau, efallai y cewch adroddiad gwallau arall pan fyddwch yn ail-uwchlwytho’r ffeil.

source: How the error report works
cy: Sut mae’r adroddiad gwallau yn gweithio

source: Next steps
cy: Camau nesaf

# read_the_report_help_you_understand
source: Read the report to help you understand where your errors are.
cy: Darllenwch yr adroddiad i’ch helpu i ddeall ble mae’ch gwallau.

source: Packaging data not uploaded – fix the errors and check the warnings
cy: Data pecynwaith heb ei uwchlwytho – trwsiwch y gwallau a gwiriwch y rhybuddion

source: Packaging data not uploaded – fix the errors and try again
cy: Data pecynwaith heb ei uwchlwytho – trwsiwch y gwallau a rhowch gynnig arall arni

# there_are_some_warnings
source: There are some warnings. Warnings are unusual entries in your file you need to check, but they will not prevent your file from being submitted to the environmental regulator.
cy: Mae rhywfaint o rybuddion. Mae rhybuddion yn gofnodion anarferol yn eich ffeil y bydd angen ichi eu gwirio, ond fyddan nhw ddim yn atal eich ffeil rhag cael ei chyflwyno i’r rheoleiddiwr amgylcheddol.

source: How to fix errors and check warnings
cy: Sut i drwsio gwallau a gwirio rhybuddion

source: How to fix errors
cy: Sut i drwsio gwallau

# this_tells_you_where_the_errors_and_warnings_are
source: This tells you where the errors and warnings are in your file.
cy: Mae hyn yn dweud wrthoch chi ble mae’r gwallau a’r rhybuddion yn eich ffeil.

# this_tells_you_where_the_errors_are
source: This tells you where the errors are in your file.
cy: Mae hyn yn dweud wrthoch chi ble mae’r gwallau yn eich ffeil.

# check_warnings_update_data
source: Check the warnings and decide if you want to update any data.
cy: Gwiriwch y rhybuddion a phenderfynwch a ydych chi am ddiweddaru unrhyw ddata.

# fix_errors_upload_file_again
source: When you have fixed the errors, upload your file again.
cy: Pan fyddwch chi wedi trwsio’r gwallau, uwchlwythwch eich ffeil eto.

# when_youve_fixed_the_errors_and_checked_warnings_in_your_file
source: When you have fixed the errors and checked the warnings, upload your file again.
cy: Pan fyddwch chi wedi trwsio’r gwallau ac wedi gwirio’r rhybuddion, uwchlwythwch eich ffeil eto.

# use_the_report_to_fix_the_errors
source: Use the report to fix the errors. You may also need the
cy: Defnyddiwch yr adroddiad i drwsio’r gwallau. Efallai y bydd arnoch chi angen y

# file_specification_guidance
source: file specification guidance (opens in a new window)
cy: canllawiau ar fanyleb y ffeil hefyd (yn agor mewn ffenestr newydd)
