Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadWarning/FileUploadWarning.*.resx
Languages: cy

# check_the_warnings
source: Packaging data uploaded – check the warnings
cy: Data pecynwaith wedi’i uwchlwytho – gwiriwch y rhybuddion

# decide_if_you_want_to_update
source: Decide if you want to update any data.
cy: Penderfynwch a ydych chi am ddiweddaru unrhyw ddata.

# download_warning_report
source: Download your warning report (CSV, maximum {0})
cy: Lawrlwythwch eich adroddiad gwallau (CSV, {0} ar y mwyaf)

source: How to check warnings
cy: Sut i wirio rhybuddion

# tells_you_where_warnings_are
source: This tells you where the warnings are in your file.
cy: Mae hyn yn dweud wrthoch chi ble mae’r rhybuddion yn eich ffeil.

# there_are_some_warnings
source: There are some warnings. Warnings are unusual entries in your file you need to check, but they will not prevent your file from being submitted to the environmental regulator.
cy: Mae rhywfaint o rybuddion. Mae rhybuddion yn gofnodion anarferol yn eich ffeil y bydd angen ichi eu gwirio, ond fyddan nhw ddim yn atal eich ffeil rhag cael ei chyflwyno i’r rheoleiddiwr amgylcheddol.

# upload_new_file_or_keep
source: Upload a new file or keep your existing file.
cy: Uwchlwythwch ffeil newydd neu cadwch eich ffeil bresennol.

# use_the_report_to_check_warnings
source: Use the report to check the warnings. You may also need the
cy: Defnyddiwch yr adroddiad i wirio’r rhybuddion. Efallai y bydd arnoch chi angen y

# we_can_only_show_x_warnings
source: We can only show you the first {0} warnings in the report.
cy: Dim ond y {0} cyntaf o rybuddion yn yr adroddiad y gallwn eu dangos ichi.

# your_data_file_has_been_uploaded
source: Your data file has been uploaded to your organisation’s account. There are 0 errors.
cy: Mae eich ffeil ddata wedi’i huwchlwytho i gyfrif eich sefydliad. Does dim gwallau.

# file_specification_guidance
source: file specification guidance (opens in a new window)
cy: canllawiau ar fanyleb y ffeil hefyd (yn agor mewn ffenestr newydd)

source: Do you want to upload a new file?
cy: Hoffech chi uwchlwytho ffeil newydd?

source: Yes
cy: Hoffwn

# no_keep_this_file_uploaded
source: No, keep this file uploaded to my organisation’s account
cy: Na hoffwn. Cadwch y ffeil yma wedi’i huwchlwytho i gyfrif fy sefydliad i.
