Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUpload/FileUpload.*.resx
Languages: cy

source: Upload your file
cy: Uwchlwythwch eich ffeil

# file_upload_is_invalid
source: File upload is invalid - try again
cy: Mae’r ymgais i uwchlwytho ffeil yn annilys – rhowch gynnig arall arni

source: Select a CSV file
cy: Dewiswch ffeil CSV

source: The selected file is empty
cy: Mae’r ffeil a ddewiswyd yn wag

source: The selected file must be a CSV
cy: Rhaid i’r ffeil a ddewiswyd fod yn ffeil CSV

# the_selected_file_must_be_smaller_than
source: The selected file must be smaller than {0}MB
cy: Rhaid i’r ffeil a ddewiswyd fod yn llai na {0}MB

# upload_data_for_x
source: Upload data for {0}
cy: Uwchlwytho data ar gyfer {0}

# upload_your_members_packaging_data
source: Upload your members’ packaging data in a CSV file. The file must be smaller than 256MB.
cy: Uwchlwytho data pecynwaith eich aelodau mewn ffeil CSV. Rhaid i’r ffeil fod yn llai na 256MB.

# once_weve_validated_the_data
source: Once we have validated the data, we store the file on your account.
cy: Unwaith y byddwn wedi dilysu’r data, rydym yn storio’r ffeil ar eich cyfrif.

# upload_your_organisations_packaging_data
source: Upload your organisation’s packaging data in a CSV file. The file must be smaller than 256MB.
cy: Uwchlwytho data pecynwaith eich sefydliad mewn ffeil CSV. Rhaid i’r ffeil fod yn llai na 256MB.

source: Upload packaging data to your account
cy: Uwchlwytho data pecynwaith i’ch cyfrif

# errors_youll_need_to_fix
source: errors – you’ll need to fix all errors and upload your file again
cy: gwallau – bydd angen ichi drwsio’r holl wallau ac uwchlwytho’ch ffeil eto

# if_there_is_a_problem_well_tell_you_about
source: If there’s a problem, we’ll tell you about:
cy: Os oes problem, byddwn yn dweud wrthoch chi am y canlynol:

# warnings_these_are_unusual_entries_youll_need_to_check
source: warnings – these are unusual entries you’ll need to check, like very low packaging weights, but they will not prevent your file from being submitted to the environmental regulator
cy: rhybuddion – mae’r rhain yn gofnodion anarferol y bydd angen ichi eu gwirio, fel pwysau pecynwaith isel iawn, ond fyddan nhw ddim yn atal eich ffeil rhag cael ei chyflwyno i’r rheoleiddiwr amgylcheddol

source: Upload file
cy: Uwchlwytho ffeil
