Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadSubmissionConfirmation/FileUploadSubmissionConfirmation.*.resx
Languages: cy

source: Packaging data submitted to the environmental regulator
cy: Data pecynwaith wedi’i gyflwyno i’r rheoleiddiwr amgylcheddol

source: Go to your account homepage
cy: Mynd i dudalen hafan eich cyfrif

source: Print this page
cy: Argraffu’r tudalen yma

# submitted_by_x_at_y_on_z
source: Submitted by {0} at {1} on {2}.
cy: Wedi’i gyflwyno gan {0} am {1} ar {2}.

source: They will contact your organisation if there are any issues.
cy: Byddan nhw’n cysylltu â’ch sefydliad os oes unrhyw broblemau.

source: They will email or phone your organisation if there are any issues.
cy: Byddan nhw’n anfon neges ebost neu’n ffonio’ch sefydliad os oes unrhyw broblemau.

source: The environmental regulator will review the packaging data.
cy: Bydd y rheoleiddiwr amgylcheddol yn adolygu’r data pecynwaith.

source: The environmental regulator will review your packaging data.
cy: Bydd y rheoleiddiwr amgylcheddol yn adolygu’ch data pecynwaith.

source: What happens next
cy: Beth sy’n digwydd nesaf

source: You can save this page using the ‘print’ option in your browser.
cy: Gallwch gadw’r tudalen yma drwy ddefnyddio’r opsiwn ’print’ yn eich porwr.
