Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadSubLanding/FileUploadSubLanding.*.resx
Languages: cy

source: Before you start
cy: Cyn ichi ddechrau

source: Report packaging data for
cy: Rhoi gwybod am ddata pecynwaith ar gyfer

# deadline
source: Deadline: 11:59pm on
cy: Dyddiad cau: 11:59pm ar

# how_to_build_a_csv_file_to_report_your_packaging_data
source: how to build a CSV file to report your packaging data (opens in a new window)
cy: sut i adeiladu ffeil CSV i roi gwybod am eich data pecynwaith (yn agor mewn ffenestr newydd)

source: Not Started
cy: Heb ddechrau

source: Read the guidance on:
cy: Darllenwch y canllawiau ar y canlynol:

source: Report packaging data
cy: Rhoi gwybod am ddata pecynwaith

source: File uploaded
cy: Ffeil wedi’i huwchlwytho

source: Start now
cy: Dechrau nawr

# what_packaging_data_you_need_to_collect
source: what packaging data you need to collect (opens in a new window)
cy: pa ddata pecynwaith y mae angen ichi ei gasglu (yn agor mewn ffenestr newydd)

source: Submitted to regulator
cy: Wedi’u cyflwyno i’r rheoleiddiwr

source: Cannot start yet
cy: Methu dechrau eto

source: Report members’ packaging data for
cy: Rhoi gwybod am ddata pecynwaith aelodau ar gyfer

source: Large organisations
cy: Sefydliadau mawr

# check_the_govuk_guidance
source: Check the GOV.UK guidance (opens in a new window)
cy: Gwiriwch y canllawiau ar GOV.UK (yn agor mewn ffenestr newydd)

# if_youve_missed_a_deadline
source: If you’ve missed a deadline, you may still be able to report without facing enforcement action.
cy: Os ydych chi wedi colli dyddiad cau, mae’n dal yn bosibl y gallwch chi gyflwyno adroddiad heb wynebu camau gorfodi.

source: If you’ve missed a deadline to submit
cy: Os ydych chi wedi colli dyddiad cau cyflwyno

# an_example_csv_file
source: an example CSV file (opens in new window)
cy: enghraifft o ffeil CSV (yn agor mewn ffenestr newydd)

source: Accepted by Regulator
cy: W Accepted by Regulator

source: Approved By Regulator
cy: W Approved By Regulator

source: Check if you need to resubmit member's packaging data
cy: W Check if you need to resubmit member's packaging data

source: Check if you need to resubmit packaging data
cy: W Check if you need to resubmit packaging data

source: Check if you need to update member's packaging data
cy: W Check if you need to update member's packaging data

source: Rejected by Regulator
cy: W Rejected by Regulator

source: Resubmit member's packaging data
cy: W Resubmit member's packaging data

source: Resubmit packaging data
cy: W Resubmit packaging data

# status_unknown
source: Submission status is unknown
cy: W Submission status is unknown

# update_members_packaging_data_basic
source: Update member's packaging data
cy: W Update member's packaging data

# update_packaging_data_basic
source: Update packaging data
cy: W Update packaging data

source: View submission history
cy: W View submission history

source: View your packaging data files
cy: W View your packaging data files

source: Your history
cy: W Your history

source: Check if you need to update packaging data
cy: W Check if you need to update packaging data
