Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadCompanyDetailsSuccess/FileUploadCompanyDetailsSuccess.*.resx
Languages: cy

source: Success
cy: Llwyddiant

source: Upload company details completed
cy: Wedi gorffen uwchlwytho manylion y cwmni

# organisation_details_updated
source: Organisation details uploaded
cy: Manylion y sefydliad wedi’u huwchlwytho

source: If you think this is incorrect, you can
cy: Os ydych chi’n credu bod hyn yn anghywir, gallwch

source: re-upload your organisation details
cy: ail-uwchlwytho manylion eich sefydliad

source: What happens next
cy: Beth sy’n digwydd nesaf

source: brand information
cy: gwybodaeth brand

source: Based on what is in the file, you also need to report brand information.
cy: Yn seiliedig ar yr hyn sydd yn y ffeil, mae angen ichi hefyd roi gwybod am wybodaeth brand.

source: Based on what is in the file, you also need to report partner information.
cy: Yn seiliedig ar yr hyn sydd yn y ffeil, mae angen ichi hefyd roi gwybod am wybodaeth am bartneriaid.

source: Upload brand information
cy: Uwchlwytho gwybodaeth brand

source: Upload partner information
cy: Uwchlwytho gwybodaeth am bartneriaid

# based_on_what
source: Based on what is in the file,
cy: Yn seiliedig ar yr hyn sydd yn y ffeil,

# you_do_not_need_to_report_information
source: you do not need to report information about brands or partners
cy: does dim angen i chi roi gwybod am frandiau neu bartneriaid

source: you also need to report about:
cy: mae angen ichi hefyd roi gwybod am y canlynol:

# you_can_now_see
source: You can now see a list of the files youâ€™ve uploaded, and change them if you need to.
cy: Nawr gallwch chi weld rhestr o’r ffeiliau rydych chi wedi’u huwchlwytho, a’u newid os oes angen ichi wneud hynny.

source: partners
cy: partneriaid

source: You do not need to report partner information.
cy: Does dim angen ichi roi gwybod am wybodaeth am bartneriaid.

source: You do not need to report brand information.
cy: Does dim angen ichi roi gwybod am wybodaeth brand.
