Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/ErrorMessages.*.resx
Languages: cy

# privacy_policy_not_approved
source: You must accept the Privacy Policy in order to continue with Scheme Registration
cy: Rhaid ichi dderbyn y Polisi Preifatrwydd er mwyn parhau i gofrestru ar gyfer y cynllun

# declaration_not_approved
source: You must make the declaration in order to continue scheme registration
cy: Rhaid ichi wneud y datganiad er mwyn parhau i gofrestru ar gyfer y cynllun

source: Select yes if you want to submit your packaging data
cy: Dewiswch ie os hoffech chi gyflwyno’ch data pecynwaith

# declaration_name_max_length_key
source: Full name must be 200 characters or less
cy: Rhaid i’r enw llawn fod yn 200 neu lai o gymeriadau

# declaration_name_required_key
source: Enter your full name
cy: Rhowch eich enw llawn

# using_compliance_scheme_selection_error
source: Select if you're using a compliance scheme
cy: Dewiswch a ydych chi’n defnyddio cynllun cydymffurfio

# select_which_compliance_error
source: Select which compliance scheme you’re using
cy: Dewiswch pa gynllun cydymffurfio rydych chi’n ei ddefnyddio

# select_whether_youve_changed_compliance_scheme
source: Select whether you’ve changed compliance scheme or no longer use one.
cy: Dewiswch a ydych chi wedi newid cynllun cydymffurfio neu wedi rhoi’r gorau i ddefnyddio un.

source: Select yes if you would like to remove this member from your account
cy: Dewiswch Ydw os hoffech chi dynnu’r aelod yma o’ch cyfrif

source: Select yes if you want to upload a new file
cy: Dewiswch ‘hoffwn’ os hoffech chi uwchlwytho ffeil newydd
