Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/ErrorCodes.*.resx
Languages: cy

# ErrorIssue
source: Error
cy: Gwall

# WarningIssue
source: Warning
cy: Rhybudd

source: Organisation ID must be a 6 digit number - for example, 100123
cy: Rhaid i ID y sefydliad fod yn rhif 6 digid - er enghraifft, 100123

source: When packaging activity is entered, it must be one of the codes SO, PF, IM, SE, HL or OM
cy: Wrth roi gweithgaredd pecynnu, rhaid ichi roi un o'r codau SO, PF, IM, SE, HL neu OM

source: Packaging type must be one of the codes HH, NH, CW, OW, PB, RU, HDC, NDC or SP
cy: Rhaid i'r math o ddeunydd pecynwaith fod yn un o'r codau HH, NH, CW, OW, PB, RU, HDC, NDC neu SP

source: When packaging class is entered, it must be one of the codes P1, P2, P3, P4, P5, P6, O1, O2 or B1
cy: Wrth roi'r dosbarth pecynwaith, rhaid ichi roi un o'r codau P1, P2, P3, P4, P5, P6, O1, O2 neu B1

source: Packaging material must be one of the codes AL, FC, GL, PC, PL, ST, WD or OT
cy: Rhaid i'r deunydd pecynwaith fod yn un o'r codau AL, FC, GL, PC, PL, ST, WD neu OT

source: When packaging type is self-managed waste (CW or OW), from country must be one of England (EN), Northern Ireland (NI), Scotland (SC) or Wales (WS)
cy: Os gwastraff hunan-reoledig (CW neu OW) yw'r math o becynwaith, rhaid i'r wlad mae'n dod ohoni fod yn un o blith Lloegr (EN), Gogledd Iwerddon (NI), yr Alban (SC) neu Gymru (WS)

source: When packaging type is self-managed waste (CW or OW), and you send it to another country, the to country must be one of England (EN), Northern Ireland (NI), Scotland (SC) or Wales (WS)
cy: Os gwastraff hunan-reoledig (CW neu OW) yw'r math o becynwaith, a'ch bod chi'n ei anfon i wlad arall, rhaid i'r wlad mae'n cael ei anfon iddi fod yn un o blith Lloegr (EN), Gogledd Iwerddon (NI), yr Alban (SC) neu Gymru (WS)

source: Packaging material weight must be a whole number in kilograms. For example, 50000. Do not include the words 'kilograms' or 'kgs'.
cy: Rhaid i bwysau'r deunydd pecynwaith fod yn rhif gyfan mewn cilogramau. Er enghraifft, 50,000. Peidiwch â chynnwys y geiriau 'cilogramau' neu 'kgs'.

source: Packaging material units must be a whole number
cy: Rhaid i unedau'r deunydd pecynwaith fod yn rhif cyfan

source: Cannot be going from and to the same country in the UK
cy: Ni all fod yn mynd o'r un wlad ac i'r un wlad yn y Deyrnas Unedig

source: To country is not needed for this packaging type
cy: Does dim angen y wlad mae'n cael ei anfon iddi ar gyfer y math yma o becynwaith

source: From country is not needed for this packaging type
cy: Does dim angen y wlad mae'n dod ohoni ar gyfer y math yma o becynwaith

source: Invalid combination of organisation size and packaging activity and packaging type
cy: Cyfuniad annilys o faint y sefydliad a gweithgaredd pecynwaith a math pecynwaith

source: For large organisations (L), when packaging activity is supplied through an online marketplace that you own (OM), packaging type must be household packaging (HH) or non-household packaging (NH)
cy: Yn achos sefydliadau mawr (L), pan fo'r gweithgaredd pecynnu yn cael ei gyflenwi trwy farchnad ar-lein sy'n perthyn i chi (OM), rhaid i'r math o becynwaith fod yn becynwaith cartref (HH) neu becynwaith nad yw'n becynwaith cartref (NH)

source: When packaging activity is supplied through an online marketplace that you own (OM), and packaging type is household packaging (HH), packaging class must be online marketplace total (P6)
cy: Pan fo'r gweithgaredd pecynnu yn cael ei gyflenwi trwy farchnad ar-lein sy'n perthyn i chi (OM), a'r math o ddeunydd pecynwaith yw pecynwaith cartref (HH), rhaid i ddosbarth y pecynwaith fod yn gyfanswm y farchnad ar-lein (P6)

source: When packaging activity is supplied through an online marketplace that you own (OM), and packaging type is non-household packaging (NH), packaging class must be online marketplace total (P6)
cy: Pan fo'r gweithgaredd pecynnu yn cael ei gyflenwi trwy farchnad ar-lein sy'n perthyn i chi (OM), a'r math o ddeunydd pecynwaith yw pecynwaith nad yw'n becynwaith cartref (NH), rhaid i ddosbarth y pecynwaith fod yn gyfanswm y farchnad ar-lein (P6)

source: Invalid combination of packaging activity and packaging type and packaging class
cy: Cyfuniad annilys o weithgaredd pecynwaith a math pecynwaith a dosbarth pecynwaith

source: When packaging type is non-household waste (NH), packaging class must be one of the codes P1, P2, P3 or P4
cy: Os pecynwaith nad yw'n becynwaith cartref yw'r math o becynwaith, rhaid i ddosbarth y pecynwaith fod yn un o'r codau P1, P2, P3 neu P4

source: Packaging type is self-managed consumer waste (CW) so packaging class can only be self-managed consumer waste - all (O1)
cy: Gwastraff defnyddwyr hunan-reoledig (CW) yw'r math o becynwaith, felly gwastraff defnyddwyr hunan-reoledig - i gyd (O1) yw'r unig ddosbarth pecynwaith sy'n bosibl

source: Packaging type is self-managed organisation waste (OW) so packaging class can only be organisation waste - origin (O2)
cy: Gwastraff sefydliad hunan-reoledig (OW) yw'r math o becynwaith, felly gwastraff sefydliad - tarddiad (O2) yw'r unig ddosbarth pecynwaith sy'n bosibl

source: Packaging type is household packaging (HH) so packaging class can only be one of primary packaging (P1), shipment packaging (P3) or online marketplace total (P6)
cy: Pecynwaith cartref (HH) yw'r math o becynwaith, felly un o blith pecynwaith sylfaenol (P1), pecynwaith cludo (P3) neu gyfanswm y farchnad ar-lein (P6) yw'r unig ddosbarth pecynwaith sy'n bosibl

source: Packaging type is commonly ends up in public bins (PB) so packaging class can only be public bin (B1)
cy: Yn dod i ben yn gyffredin mewn biniau cyhoeddus (PB) yw'r math pecynwaith felly dim ond bin cyhoeddus (B1) all gael ei roi fel dosbarth pecynwaith.

source: Packaging type is household drinks containers (HDC) or non-household drinks containers (NDC) so do not enter a packaging class
cy: Cynwysyddion diodydd cartref (HDC) neu gynwysyddion diodydd nad ydynt yn gynwysyddion diodydd cartref (NDC) yw'r math o becynwaith, felly peidiwch â rhoi dosbarth pecynwaith

source: Packaging type is reusable packaging (RU) so packaging class can only be primary packaging (P1) or non-primary reusable packaging (P5)
cy: Pecynwaith ailddefnyddiadwy (RU) yw'r math o becynwaith, felly pecynwaith sylfaenol (P1) neu becynwaith ailddefnyddiadwy nad yw'n becynwaith sylfaenol (P5) yw'r unig ddosbarth pecynwaith sy'n bosibl

source: Invalid combination of packaging class and packaging type
cy: Cyfuniad annilys o ddosbarth pecynwaith a math pecynwaith

source: Packaging material for household drinks containers (HDC) and non-household drinks containers (NDC) must be one of aluminium (AL), glass (GL), plastic (PL) or steel (ST)
cy: Rhaid i'r deunydd pecynwaith ar gyfer cynwysyddion diodydd cartref (HDC) a chynwysyddion diodydd nad ydynt yn gynwysyddion diodydd cartref (NDC) fod yn un o blith alwminiwm (AL), gwydr (GL), plastig (PL) neu ddur (ST)

source: Packaging material units not needed for this packaging type
cy: Does dim angen unedau deunydd pecynwaith ar gyfer y math yma o ddeunydd pecynwaith

source: Packaging type is household drinks containers (HDC) or non-household drinks containers (NDC) so packaging material quantity must be a whole number
cy: Cynwysyddion diodydd cartref (HDC) neu gynwysyddion diodydd nad ydynt yn gynwysyddion diodydd cartref (NDC) yw'r math o becynwaith, felly rhaid i swm y deunydd pecynwaith fod yn rhif cyfan

source: Duplicate information submitted
cy: Gwybodaeth ddyblyg wedi'i chyflwyno

source: Organisation size must be L. Currently, only large organisations can report packaging data.
cy: Rhaid i faint y sefydliad fod yn L. Ar hyn o bryd, dim ond sefydliadau mawr sy'n cael rhoi gwybod am ddata pecynwaith.

source: When packaging material is other (OT), you must enter the name of the material in packaging material subtype. It must not include numbers or commas.
cy: Pan fo'r deunydd pecynwaith yn arall (OT), rhaid ichi nodi enw'r deunydd mewn is-deip deunydd pecynwaith. Ni chaniateir rhifau na choma.

source: Packaging material subtype not needed for this packaging material
cy: Dim angen is-deip pecynwaith ar gyfer y math pecynwaith yma

source: When packaging activity is entered, packaging type cannot be self-managed waste (CW and OW)
cy: Pan fyddwch chi'n rhoi'r gweithgaredd pecynnu, nid yw'r math o becynwaith yn cael bod yn wastraff hunan-reoledig (CW ac OW)

source: When packaging activity is not entered, packaging type can only be self-managed waste (CW and OW)
cy: Pan na fyddwch chi'n rhoi'r gweithgaredd pecynnu, gwastraff hunan-reoledig (CW ac OW) yw'r unig fath o becynwaith sy'n bosibl

source: Enter the time period for submission
cy: Rhowch y cyfnod amser ar gyfer y cyflwyniad

source: Subsidiary ID must only include letters a to z, and numbers. It must be 32 characters or less.
cy: Mae'r ID atodol yn cael cynnwys y llythrennau a i z, a rhifau yn unig. Rhaid iddo fod yn 32 o gymeriadau neu lai.

source: The selected file is empty
cy: Mae’r ffeil a ddewiswyd yn wag

source: Column names in the selected file might be missing, incorrect or in the wrong order. Follow the guidance on how to structure your data submission.
cy: Gallai enwau’r colofnau yn y ffeil a ddewiswyd fod ar goll, yn anghywir neu yn y drefn anghywir. Dilynwch y canllawiau ar sut i strwythuro’ch cyflwyniad data.

source: The selected file contains a virus
cy: Mae’r ffeil a ddewiswyd yn cynnwys feirws

source: Sorry, an unexpected issue occurred (code 89). Please try your upload again later.
cy: Mae’n ddrwg gennym, cododd problem annisgwyl (cod 89). Rhowch gynnig ar yr uwchlwytho eto yn nes ymlaen.

source: Sorry, an unexpected issue occurred (code 99). Please try your upload again later.
cy: Mae’n ddrwg gennym, cododd problem annisgwyl (cod 99). Rhowch gynnig ar yr uwchlwytho eto yn nes ymlaen.

source: You're reporting packaging data for January to June 2023. Submission period must be 2023-P1 or 2023-P2.
cy: Rydych chi'n rhoi gwybod am ddata pecynwaith ar gyfer Ionawr i Fehefin 2023. Rhaid i'r cyfnod cyflwyno fod yn 2023-P1 neu 2023-P2.

source: You're reporting packaging data for July to December 2023. Submission period must be 2023-P3.
cy: Rydych chi'n rhoi gwybod am ddata pecynwaith ar gyfer Gorffennaf i Ragfyr 2023. Rhaid i'r cyfnod cyflwyno fod yn 2023-P3.

source: Your file was not uploaded. This is because the column headings are not in the right place.<br><br> Read the guidance about how to create your organisation details file. Once youâ€™ve fixed the problem, upload the file again.
cy: Chafodd eich ffeil mo’i huwchlwytho, a hynny am nad yw penawdau’r colofnau yn y lle cywir.<br><br> Darllenwch y canllawiau ar sut i greu’ch ffeil manylion sefydliad. Ar ôl ichi ddatrys y broblem, uwchlwythwch y ffeil eto.

source: When packaging type is self-managed waste (CW and OW), you must enter the from country
cy: Pan fo'r math pecynwaith yn wastraff hunan-reoledig (CW ac OW), rhaid ichi roi'r wlad mae'n tarddu ohoni

source: Submission period must be the same for all of this organisation's packaging data
cy: Rhaid i'r cyfnod amser ar gyfer cyflwyno fod yr un fath ar gyfer holl ddata pecynwaith y sefydliad yma

source: Packaging material subtype cannot be plastic, HDPE or PET
cy: Nid yw is-deip y deunydd pecynwaith yn gallu bod yn blastig, HDPE neu PET

source: When organisation size is large (L), packaging type cannot be small organisation packaging - all (SP)
cy: Pan fo maint y sefydliad yn fawr (L), ni chaniateir i'r math pecynwaith fod yn becynwaith sefydliad bach – y cyfan (SP)

source: Total weight of a single packaging material transferred to any country must not be more than the total collected. For example, you cannot transfer more plastic than you collect. Check the weight of this packaging material transferred to another country for all rows for this organisation.
cy: Ni chaiff cyfanswm pwysau unrhyw un deunydd pecynwaith sy'n cael ei drosglwyddo i unrhyw wlad fod yn fwy na'r cyfanswm a gasglwyd. Er enghraifft, allwch chi ddim trosglwyddo mwy o blastig nag rydych chi'n ei gasglu. Gwiriwch bwysau'r deunydd pecynwaith yma sy'n cael ei drosglwyddo i wlad arall ym mhob rhes ar gyfer y sefydliad yma.

source: Organisation ID must be the same as the identification number assigned to your organisation when your account was created
cy: Rhaid i ID y sefydliad fod yr un fath â’r rhif adnabod a gafodd ei roi i’ch sefydliad pan gafodd eich cyfrif ei greu

source: Packaging material weight is less than 100. Check all packaging weights are in kg and not tonnes.
cy: Mae pwysau'r deunydd pecynwaith yn llai na 100. Gwiriwch fod yr holl bwysau pecynwaith mewn kg ac nid tunelli.

source: Check packaging material weight (kg) and units are correct
cy: Gwiriwch fod pwysau'r deunydd pecynwaith (kg) a'r unedau yn gywir

source: Organisation ID must be the same as the identification number assigned to this organisation when they created their account. Check the organisation ID for all rows for this organisation.
cy: Rhaid i ID y sefydliad fod yr un fath â'r rhif adnabod a gafodd ei roi i'r sefydliad yma pan gafodd eu cyfrif ei greu. Gwiriwch ID y sefydliad ym mhob rhes ar gyfer y sefydliad yma.

source: Organisation ID is not linked to your compliance scheme. Check the organisation ID for all rows for this organisation.
cy: Nid yw ID y sefydliad wedi'i gysylltu â'ch cynllun cydymffurfio. Gwiriwch ID y sefydliad ym mhob rhes ar gyfer y sefydliad yma.

source: Only one packaging material reported for this organisation. Check you have entered all packaging materials. All must be reported separately.
cy: Rydych chi wedi rhoi gwybod am un deunydd pecynwaith yn unig ar gyfer y sefydliad yma. Gwiriwch eich bod wedi rhoi pob deunydd pecynwaith. Rhaid ichi roi gwybod am bob un ar wahân.

source: Check the packaging material weight for all rows for this organisation. If the total for the reporting year is between 25,000kg and 50,000kg, this organisation may only need to register as a small organisation in the following year.
cy: Gwiriwch bwysau'r deunydd pecynwaith ar gyfer pob rhes i'r sefydliad yma. Os yw cyfanswm y flwyddyn adrodd rhwng 25,000kg a 50,000kg, efallai mai dim ond fel sefydliad bach y bydd angen i'r sefydliad yma gofrestru yn y flwyddyn ganlynol.

source: For self-managed consumer waste (CW), you may not be able to offset your own packaging against aluminium (AL), glass (GL), paper or card (PC), or steel (ST). To check what packaging materials you can offset, you'll need to contact your nation's environmental regulator.
cy: Yn achos gwastraff defnyddwyr hunan-reoledig (CW), mae'n bosibl na fyddwch chi'n gallu gwrthbwyso'ch pecynwaith eich hunan yn erbyn alwminiwm (AL), gwydr (GL), papur neu gerdyn (PC), neu ddur (ST). I wirio pa ddeunyddiau pecynwaith y gallwch eu gwrthbwyso, bydd angen ichi gysylltu â rheoleiddiwr amgylcheddol eich gwlad.
