Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/SchemeMembership/ConfirmationOfRemoval.*.resx
Languages: cy

# ConfirmationOfRemoval.YouHaveRemoved
source: You’ve removed
cy: Rydych chi wedi tynnu

# ConfirmationOfRemoval.FromAccount
source: from your account
cy: o’ch cyfrif

# ConfirmationOfRemoval.IfRemoved
source: If you removed
cy: Os ydych chi wedi tynnu

# ConfirmationOfRemoval.FromAccountByMistake
source: from your account by mistake, you should ask them to name you as their compliance scheme in their ‘report packaging data’ account.
cy: o’ch cyfrif trwy gamgymeriad, dylech ofyn iddyn nhw eich enwi fel eu cynllun cydymffurfio yn eu cyfrif ’rhoi gwybod am ddata pecynwaith’.

# ConfirmationOfRemoval.WhatHappensNext
source: What happens next
cy: Beth sy’n digwydd nesaf

# ConfirmationOfRemoval.YouMustRemoved
source: You must remove
cy: Rhaid ichi dynnu

# ConfirmationOfRemoval.FromMember
source: from your members’ organisation details file.
cy: o ffeil manylion eich sefydliad aelodau.

# ConfirmationOfRemoval.IfYouUploadFile
source: If you’ve already uploaded this file, you’ll need to remove this member and then re-upload the file. If you’ve submitted this file to the environmental regulator, you must re-submit the updated file within the next 28 days.
cy: Os ydych chi eisoes wedi uwchlwytho’r ffeil yma, bydd angen ichi dynnu’r aelod yma ac yna ail-uwchlwytho’r ffeil. Os ydych chi wedi cyflwyno’r ffeil yma i’r rheoleiddiwr amgylcheddol, rhaid ichi ailgyflwyno’r ffeil wedi’i diweddaru o fewn yr 28 diwrnod nesaf.

# ConfirmationOfRemoval.NextStep
source: Next steps
cy: Y camau nesaf

# ConfirmationOfRemoval.ReUpload
source: re-upload and submit members’ organisation details
cy: ail-uwchlwytho a chyflwyno manylion y sefydliad aelodau

# ConfirmationOfRemoval.ReturnSchemeMembers
source: return to view all scheme members
cy: yn ôl i weld holl aelodau’r cynllun

# ConfirmationOfRemoval.PageTitle
source: Confirmation of removal
cy: Cadarnhad bod yr aelod wedi’i dynnu
