Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/Privacy/Detail.*.resx
Languages: cy

# Privacy.Address
source: address if used for business purposes, including postcode
cy: eich cyfeiriad os yw’n cael ei ddefnyddio at ddibenion busnes, gan gynnwys y cod post

# Privacy.AnyChanges
source: Any changes to this privacy policy will apply to you and your data immediately. If these changes affect how your personal data is processed, we will let you know.
cy: Bydd unrhyw newidiadau yn y polisi preifatrwydd yma yn gymwys i chi a’ch data ar unwaith. Os bydd y newidiadau hyn yn effeithio ar sut mae’ch data personol yn cael ei brosesu, byddwn yn rhoi gwybod i chi.

# Privacy.CalculateAdmin
source: calculate administrative fees
cy: yn cyfrifo ffioedd gweinyddol

# Privacy.CalculateWaste
source: calculate waste disposal fees
cy: yn cyfrifo ffioedd gwaredu gwastraff

# Privacy.ChangesToThisPolicy
source: Changes to this policy
cy: Newidiadau yn y polisi yma

# Privacy.Complaints
source: Complaints
cy: Cwynion

# Privacy.DefraDataProtectionManager
source: Defra Data Protection Manager
cy: Rheolwr Diogelu Data Defra

# Privacy.DefraDataProtectionOfficer
source: Defra Data Protection Officer
cy: Swyddog Diogelu Data Defra

# Privacy.DefraAsDataProcessor
source: Defra is acting as the ‘data processor’ for the personal data being collected through the ‘report packaging data’ service.
cy: Mae Defra yn gweithredu fel y ‘prosesydd data’ ar gyfer y data personol sy’n cael ei gasglu drwy gyfrwng gwasanaeth pEPR: Gwasanaeth i Reoleiddwyr.

# Privacy.DefraRespects
source: Defra respects your personal privacy when responding to access to information requests, but we may have to share information when necessary to meet the statutory requirements of the Environmental Information Regulations 2004 and the Freedom of Information Act 2000.
cy: Mae Defra yn parchu’ch preifatrwydd personol wrth ymateb i geisiadau am wybodaeth, ond fe all fod rhaid inni rannu gwybodaeth pan fo angen hynny er mwyn bodloni gofynion statudol Rheoliadau Gwybodaeth Amgylcheddol 2004 a Deddf Rhyddid Gwybodaeth 2000.

# Privacy.Defras
source: Defra’s
cy: Mae

# Privacy.DefrasMainAddress
source: Defra’s main address for correspondence is:
cy: Dyma brif gyfeiriad Defra ar gyfer gohebiaeth:

# Privacy.DefrasPersonal
source: Defra’s personal information charter
cy: Mae siarter gwybodaeth bersonol Defra

# Privacy.DefraWillCollectYour
source: We will collect your
cy: Byddwn yn casglu

# Privacy.DefraWillKeep
source: We will keep your personal data for 7 years in line with the requirements of the Collection & Packaging Reforms (CPR) programme.
cy: Byddwn yn cadw’ch data personol am 7 mlynedd yn unol â gofynion y rhaglen Diwygiadau Casglu a Phecynwaith (CPR).

# Privacy.DefraWillOnly
source: Defra will only transfer your personal data to another country that is deemed adequate for data protection purposes.
cy: Dim ond i wlad arall yr bernir ei bod yn ddigonol at ddibenion diogelu data y bydd Defra’n trosglwyddo’ch data personol.

# Privacy.DefraWillShare
source: We will share the personal data collected under this privacy notice with the environmental regulators and the scheme administrator. We do this to provide a digital service as part of the Collection & Packaging Reforms (CPR) programme.
cy: Byddwn yn rhannu’r data personol sy’n cael ei gasglu o dan yr hysbysiad preifatrwydd yma gyda’r rheoleiddwyr amgylcheddol. Rydyn ni’n gwneud hyn i ddarparu gwasanaeth digidol fel rhan o’r rhaglen Diwygiadau Casglu a Phecynwaith (CPR).

# Privacy.EA
source: the Environment Agency (EA)
cy: Asiantaeth yr Amgylchedd (EA)

# Privacy.Email
source: email address
cy: eich cyfeiriad ebost

# Privacy.EnvironmentAgency
source: Environment Agency
cy: Asiantaeth yr Amgylchedd

# Privacy.ExplainsMoreAbout
source: explains more about your rights over your personal data.
cy: yn esbonio mwy am eich hawliau dros eich data personol.

# Privacy.FindOut
source: Find out about your
cy: Rhagor o wybodaeth am eich

# Privacy.GatherFeedback
source: gather feedback to improve our services
cy: yn casglu adborth i wella’n gwasanaethau

# Privacy.HowLong
source: How long we hold personal data
cy: Pa mor hir rydyn ni’n cadw data personol

# Privacy.IfYouDoNot
source: If you do not provide the personal data required you will not be able to participate in the service.
cy: Os na fyddwch chi’n darparu’r data personol angenrheidiol, fyddwch chi ddim yn gallu cymryd rhan yn y gwasanaeth.

# Privacy.IfYouNeedFurtherInformation
source: If you need further information about how Defra uses your personal data and your associated rights you can contact the Defra data protection manager at
cy: Os oes arnoch chi angen rhagor o wybodaeth am sut mae Defra yn defnyddio’ch data personol ac am eich hawliau cysylltiedig, gallwch gysylltu â rheolwr diogelu data Defra yn

# Privacy.IndividualRights
source: individual rights
cy: hawliau unigol

# Privacy.InformationOnHow
source: information on how you use the site, using cookies and page tagging techniques
cy: gwybodaeth am sut rydych chi’n defnyddio’r wefan, gan ddefnyddio cwcis a thechnegau tagio tudalennau

# Privacy.InThatCase
source: In that case, the ‘last updated’ date at the bottom of this page will also change.
cy: Os felly, bydd dyddiad y ‘diweddariad diwethaf’ ar waelod y tudalen yma yn newid hefyd.

# Privacy.InTheExercise
source: to do our work as a government department as part of the Collection & Packaging Reforms (CPR) programme, introduced in support the Government’s 25 Year Environment Plan, which is underpinned by the Environment Act 2021
cy: er mwyn i ni wneud ein gwaith fel adran o’r llywodraeth o dan y rhaglen Diwygiadau Casglu a Phecynwaith (CPR), a gyflwynwyd i ategu Cynllun Amgylchedd 25 Mlynedd y Llywodraeth, sydd wedi’i seilio ar Ddeddf yr Amgylchedd 2021

# Privacy.IP
source: Internet Protocol (IP) address, and details of which version of web browser you used
cy: eich cyfeiriad Protocol Rhyngrwyd (IP), a manylion pa fersiwn o borwr gwe a ddefnyddiwyd gennych

# Privacy.LastUpdated
source: Last updated
cy: Y diweddariad diwethaf

# Privacy.LawfulBasis
source: Lawful basis for processing your personal data
cy: Y sail gyfreithlon dros brosesu’ch data personol

# Privacy.MakeAComplaint
source: make a complaint
cy: gwneud cwyn

# Privacy.Monitor
source: monitor the performance and security of the online service
cy: yn monitro perfformiad a diogelwch y gwasanaeth ar-lein

# Privacy.Name
source: name
cy: eich enw

# Privacy.NationalResourcesWales
source: Natural Resources Wales
cy: Cyfoeth Naturiol Cymru

# Privacy.NIEA
source: the Northern Ireland Environment Agency (NIEA)
cy: Asiantaeth Amgylchedd Gogledd Iwerddon (NIEA)

# Privacy.NoAutomated
source: The personal data you provide is not used for
cy: Nid yw’r data personol rydych chi’n ei ddarparu yn cael ei ddefnyddio

# Privacy.NorthernIrelandEnvironmentAgency
source: Northern Ireland Environment Agency
cy: Asiantaeth Amgylchedd Gogledd Iwerddon

# Privacy.NRW
source: Natural Resources Wales (NRW)
cy: Cyfoeth Naturiol Cymru (CNC)

# Privacy.PersonalInformationCharter
source: personal information charter
cy: Siarter Gwybodaeth Bersonol

# Privacy.Questions
source: questions, queries or feedback you leave
cy: eich cwestiynau, ymholiadau neu adborth rydych chi’n eu gadael

# Privacy.RespondToAnyFeedback
source: respond to any feedback you send us
cy: yn ymateb i unrhyw adborth a anfonwch aton ni

# Privacy.ScottishEnvironmentalProtectionAgency
source: Scottish Environment Protection Agency
cy: Asiantaeth Diogelu Amgylchedd yr Alban

# Privacy.SEPA
source: the Scottish Environment Protection Agency (SEPA)
cy: Asiantaeth Diogelu Amgylchedd yr Alban (SEPA)

# Privacy.ShareItCosts
source: share it with the scheme administrator so they can work out disposal costs
cy: yn ei rannu gyda gweinyddwr y cynllun er mwyn iddyn nhw gyfrifo’r costau gwaredu

# Privacy.ShareItRequest
source: share it with the environmental regulators so they know who has submitted organisation and packaging data, and so they can approve or refuse a request to be an ‘approved person’ or someone with ‘delegated authority’
cy: yn ei rannu gyda’r rheoleiddwyr amgylcheddol fel eu bod nhw’n gwybod pwy sydd wedi cyflwyno data am sefydliad ac am becynwaith, ac yn gallu cymeradwyo neu wrthod cais i fod yn ‘berson a gymeradwywyd’ neu’n berson sydd ag ‘awdurdod dirprwyedig’

# Privacy.ShareItWho
source: share it with the environmental regulators so they know who has submitted organisation and packaging data
cy: yn ei rannu gyda’r rheoleiddwyr amgylcheddol fel eu bod yn gwybod pwy sydd wedi cyflwyno data am sefydliad ac am becynwaith

# Privacy.ShareThirdParty
source: share with a third party organisation contracted to manage the invoicing of organisations for disposal cost obligations
cy: yn ei rannu gyda sefydliad trydydd parti sydd wedi’i gontractio i reoli’r broses o anfonebu sefydliadau am eu rhwymedigaethau ynglŷn a chostau gwaredu

# Privacy.Telephone
source: telephone or mobile number
cy: eich rhif ffôn neu’ch rhif ffôn symudol

# Privacy.TheDataProtectionOfficer
source: The Data Protection Officer for Defra is responsible for monitoring that Defra complies with the relevant data protection legislation.
cy: Swyddog Diogelu Data Defra sy’n gyfrifol am fonitro bod Defra yn cydymffurfio â’r ddeddfwriaeth berthnasol ar ddiogelu data.

# Privacy.TheLawfulBasis
source: The lawful basis for processing your personal data is that it is necessary
cy: Y sail gyfreithlon dros brosesu’ch data personol yw bod hynny yn angenrheidiol

# Privacy.ThisPrivacyNotice
source: This privacy notice explains what personal data is collected through the ‘report packaging data’ service and how that personal data is used.
cy: Mae’r hysbysiad preifatrwydd yma yn esbonio pa ddata personol sy’n cael ei gasglu drwy’r gwasanaeth ‘Rhoi gwybod am ddata pecynwaith’ a sut mae’r data personol hwnnw’n cael ei ddefnyddio.

# Privacy.Title
source: Privacy notice
cy: Hysbysiad preifatrwydd

# Privacy.ToPerformATask
source: to perform a task in the public interest as part of the Collection & Packaging Reforms (CPR) programme
cy: er mwyn cyflawni tasg er budd y cyhoedd o dan y rhaglen Diwygiadau Casglu a Phecynwaith(CPR)

# Privacy.ToTheInformationCommissioner
source: to the Information Commissioner’s Office at any time.
cy: i Swyddfa’r Comisiynydd Gwybodaeth unrhyw bryd.

# Privacy.Transfer
source: Transfer of your personal data outside of the UK
cy: Trosglwyddo’ch data personol y tu allan i’r Deyrnas Unedig

# Privacy.UnderTheUK
source: under the UK General Data Protection Regulation (UK GDPR) and the Data Protection Act 2018 (DPA 2018).
cy: o dan Reoliad Cyffredinol y DU ar Ddiogelu Data (GDPR y DU) a Deddf Diogelu Data 2018 (Deddf 2018)).

# Privacy.UseOfAutomated
source: Use of automated decision-making or profiling
cy: Defnyddio dulliau gwneud penderfyniadau awtomataidd neu broffilio

# Privacy.WeCollectThisDataAnd
source: We collect this data and
cy: Rydyn ni’n casglu’r data yma ac

# Privacy.WeMayChange
source: We may change this privacy policy.
cy: Gallwn ni newid y polisi preifatrwydd yma.

# Privacy.WhatHappens
source: What happens if you do not provide the personal data
cy: Beth sy’n digwydd os na fyddwch chi’n darparu’r data personol

# Privacy.WhatPersonalData
source: What personal data we collect and how it is used
cy: Pa ddata personol rydyn ni’n ei gasglu a sut mae’n cael ei ddefnyddio

# Privacy.WhereDataIsShared
source: Where data is shared with the environmental regulators we will ensure that we have the right controls in place to protect your rights and freedoms.
cy: Pan fydd data’n cael ei rannu gyda’r rheoleiddwyr amgylcheddol, byddwn yn sicrhau bod gennyn ni’r rheolaethau cywir ar waith i ddiogelu’ch hawliau a’ch rhyddidau.

# Privacy.WhoCollects
source: Who collects your personal data
cy: Pwy sy’n casglu’ch data personol

# Privacy.WhoWeShare
source: Who we share your personal data with
cy: Gyda phwy rydyn ni’n rhannu’ch data personol

# Privacy.YouCanLearn
source: The environmental regulators are controllers in their own right. You can learn more about how your personal data is processed by the environmental regulators at the following websites
cy: Mae’r rheoleiddwyr amgylcheddol yn rheolwyr yn eu hawl eu hunain. Gallwch ddysgu mwy am sut mae’ch data personol yn cael ei brosesu gan y rheoleiddwyr amgylcheddol ar y gwefannau a ganlyn

# Privacy.YouHaveTheRight
source: You have the right to
cy: Mae gennych chi hawl

# Privacy.YourRights
source: Your rights
cy: Eich hawliau

# Privacy.DefraCollects
source: As the data processor, we collect and share data on behalf of the four environmental regulatory bodies. These are
cy: Yn rhinwedd ein swydd fel prosesydd data, rydyn ni’n casglu ac yn rhannu data ar ran y pedwar corff rheoleiddio amgylcheddol, sef

# Privacy.UseAboveAddr
source: or using the address above.
cy: neu drwy ddefnyddio’r cyfeiriad uchod.

# Privacy.DataProtectOfficer
source: The data protection officer for Defra is responsible for checking that Defra complies with legislation. You can contact them at
cy: Swyddog diogelu data Defra sy’n gyfrifol am wirio bod Defra yn cydymffurfio â’r ddeddfwriaeth. Gallwch gysylltu â nhw yma

# Privacy.ConsentToPersonalData
source: Consent to process your personal data
cy: Cydsynio i brosesu’ch data personol

# Privacy.ProcessingPersonalData
source: The processing of your personal data is not based on consent. You cannot withdraw it.
cy: Nid yw’r gwaith o brosesu’ch data personol wedi’i seilio ar gydsyniad. Chewch chi ddim tynnu hyn yn ôl.

# Privacy.AutomatedDecision
source: automated decision making (making a decision by automated means without any human involvement)
cy: gwneud penderfyniadau awtomataidd (gwneud penderfyniad drwy ddulliau awtomataidd heb unrhyw gyfraniad gan bobl)

# Privacy.Profiling
source: profiling (automated processing of personal data to evaluate certain things about an individual)
cy: proffilio (prosesu data personol yn awtomatig i werthuso pethau penodol ynglŷn ag unigolyn)

# Privacy.Heading
source: Privacy notice - ‘Report packaging data’ service
cy: Hysbysiad preifatrwydd – gwasanaeth ‘Rhoi gwybod am ddata pecynwaith’
