Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadCompanyDetailsErrors/FileUploadCompanyDetailsErrors.*.resx
Languages: cy

# organisation_details
source: Organisation details not uploaded â€“ fix errors and try again
cy: WOrganisation details not uploaded â€“ fix errors and try again

source: There are
cy: wThere are

# in_file
source: errors in your file.
cy: werrors in your file.

# this_means
source: This means the organisation details were not uploaded.
cy: wThis means the organisation details were not uploaded.

# how_to_fix
source: How to fix the errors
cy: WHow to fix the errors

# download_csv
source: Download your error report (CSV, maximum 5MB)
cy: wDownload your error report (CSV, maximum 5MB)

# this_will
source: This will tell you where the errors are in your file.
cy: wThis will tell you where the errors are in your file.

# use_report
source: Use the report to fix the errors. You may also need the
cy: wUse the report to fix the errors. You may also need the

# file_specification
source: file specification guidance (opens in new tab)
cy: wfile specification guidance (opens in new tab)

# upload_again
source: Upload the file again
cy: WUpload the file again

source: Upload file
cy: wUpload file

# errors_in_file
source: There are errors in your file. This means the organisation details were not uploaded.
cy: wThere are errors in your file. This means the organisation details were not uploaded

# 200_errors
source: The file has 200 errors or more.
cy: wThe file has 200 errors or more.

# upload_organisation_details_error
source: Organisation details not uploaded
cy: WOrganisation details not uploaded

# this_will_200
source: This will show you the first 200 errors in your file.
cy: wThis will show you the first 200 errors in your file.

source: There is
cy: wThere is

# may_get_another_error
source: If there are more errors, you may get another error report.
cy: wIf there are more errors, you may get another error report.
