Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/DeclarationWithFullName/DeclarationWithFullName.*.resx
Languages: cy

# you_can_act_on_behalf
source: you can act on behalf of {0}
cy: eich bod chi’n cael gweithredu ar ran {0}

source: Declaration
cy: Datganiad

# the_data_you_are_submitting
source: the data you are submitting is accurate
cy: bod y data rydych chi’n ei gyflwyno yn gywir

source: Enter your full name
cy: Rhowch eich enw llawn

source: Submit file
cy: Cyflwyno ffeil

# by_entering_your_name
source: By entering your name and submitting your file to the environmental regulator, you are confirming that:
cy: Trwy roi eich enw a chyflwyno’ch ffeil i’r rheoleiddiwr amgylcheddol, rydych chi’n cadarnhau:

# may_face_enforcement
source: {0} may face enforcement action if the data you submit is inaccurate.
cy: Gall {0} wynebu camau gorfodi os yw’r data y byddwch chi’n ei gyflwyno yn anghywir.

# full_name_error_message.enter_your_full_name
source: Enter your full name
cy: Rhowch eich enw llawn

# full_name_error_message.less_than_200
source: Full name must be 200 characters or less
cy: Rhaid i’r enw llawn fod yn 200 neu lai o gymeriadau

# text_assistive.warning
source: Warning
cy: WWarning
