Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileUploadCheckFileAndSubmit/FileUploadCheckFileAndSubmit.*.resx
Languages: cy

source: Packaging data uploaded
cy: Data pecynwaith wedi’i uwchlwytho

# check_and_submit_file
source: Packaging data uploaded – check and submit
cy: Data pecynwaith wedi’i uwchlwytho – gwiriwch a chyflwynwch

source: File uploaded
cy: Ffeil wedi’i huwchlwytho

source: File you’re submitting
cy: Ffeil rydych chi wrthi’n ei chyflwyno

# detail_regarding_the_latest_file_uploaded
source: Detail regarding the latest valid file uploaded
cy: Manylion y ffeil ddilys ddiweddaraf a uwchlwythwyd

source: Uploaded by
cy: Uwchlwythwyd gan

source: File name
cy: Enw’r ffeil

source: Date uploaded
cy: Dyddiad uwchlwytho

source: Last file submitted
cy: Y ffeil ddiwethaf a gyflwynwyd

source: Detail regarding the latest file submitted
cy: Manylion y ffeil ddiweddaraf a gyflwynwyd

source: Submitted by
cy: Cyflwynwyd gan

source: Date submitted
cy: Dyddiad cyflwyno

source: Confirm you want to submit the new packaging data file to the environmental regulator.
cy: Cadarnhau eich bod am gyflwyno’r ffeil data pecynwaith newydd i’r rheoleiddiwr amgylcheddol.

source: This will replace the last packaging data file that you submitted.
cy: Bydd hyn yn disodli’r ffeil data pecynwaith ddiwethaf a gyflwynwyd gennych.

source: Are you sure you want to submit your packaging data file?
cy: Ydych chi’n siŵr yr hoffech chi gyflwyno’ch ffeil data pecynwaith?

source: This information will be sent to the environmental regulator.
cy: Bydd yr wybodaeth hon yn cael ei hanfon at y rheoleiddiwr amgylcheddol.

source: Yes, I’d like to submit
cy: Hoffwn, fe hoffwn i gyflwyno

source: No, I don’t want to do this right now
cy: Na, dwi ddim eisiau gwneud hyn nawr

source: Your company may face enforcement action if the data you submit is inaccurate.
cy: Efallai y bydd eich cwmni yn wynebu camau gorfodi os yw’r data y byddwch chi’n ei gyflwyno yn anghywir.

source: How to submit your file
cy: Sut i gyflwyno’ch ffeil

# you_dont_have_permission_to_submit_files
source: You do not have permission to submit files.
cy: Does dim caniatâd gennych i gyflwyno ffeiliau.

source: Someone in your team with the right account permissions must submit this file to the environmental regulator.
cy: Rhaid i rywun yn eich tîm sydd â’r caniatadau cywir yn y cyfrif gyflwyno’r ffeil yma i’r rheoleiddiwr amgylcheddol.

source: Go to your account homepage
cy: Mynd i dudalen hafan eich cyfrif
