Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FrontendSchemeRegistration/UsingComplianceScheme.*.resx
Languages: cy

source: Are you using a compliance scheme?
cy: Ydych chi’n defnyddio cynllun cydymffurfio?

source: Yes
cy: Ydw

source: No
cy: Nac ydw

source: What is a compliance scheme?
cy: Beth yw cynllun cydymffurfio?

# compliance_schemes_are
source: Compliance schemes are third parties that help organisations meet the EPR for packaging requirements.
cy: Mae cynlluniau cydymffurfio yn drydydd partïon sy’n helpu sefydliadau i fodloni’r EPR dros ofynion pecynwaith.

source: Compliance schemes can:
cy: Mae cynlluniau cydymffurfio yn gallu:

# register_you
source: register your organisation to report packaging data
cy: cofrestru’ch sefydliad i roi gwybod am ddata pecynwaith

source: pay your registration fees
cy: talu’ch ffioedd cofrestru

# buy_prns
source: buy PRNs (packaging waste recycling notes) or PERNs (packaging waste export recycling notes) to meet your recycling obligations
cy: prynu PRNs (nodiadau ailgylchu gwastraff pecynwaith neu PERNs (nodiadau ailgylchu allforio pecynwaith gwastraff) i gyflawni’r rhwymedigaethau ynglŷn ag ailgylchu

source: report your packaging data
cy: rhoi gwybod am eich data pecynwaith

# compliance_scheme_cannot_pay
source: A compliance scheme cannot pay your waste management fee.
cy: Nid yw cynllun cydymffurfio yn gallu talu’ch ffi rheoli gwastraff.

# using_a_compliance_schema
source: Using a compliance scheme
cy: Defnyddio cynllun cydymffurfio

# error_message
source: Select if youâ€™re using a compliance scheme
cy: Dewiswch a ydych chi’n defnyddio cynllun cydymffurfio
