Repository: DEFRA/epr-prn-manage-frontend
Catalog: src/PRNPortal.UI/Resources/Views/FileReUploadCompanyDetailsConfirmation/FileReUploadCompanyDetailsConfirmation.*.resx
Languages: cy

source: Report packaging data
cy: Rhoi gwybod am ddata pecynwaith

# If_you_want_to_replace_any_of
source: If you want to replace any of the files in the account, you’ll need to re-upload all of the files relating to your organisation details. These will replace the current ones.
cy: Os hoffech chi amnewid unrhyw un neu ragor o’r ffeiliau yn y cyfrif, bydd angen ichi ail-uwchhlwytho’r holl ffeiliau sy’n ymwneud â manylion eich sefydliad. Bydd y rhain yn disodli’r rhai presennol.

# this_is_to_report_organisation_details
source: This is to report organisation details for the deadline of 11.59pm on {0} deadline. Check you’re reporting for the right deadline before you continue.
cy: Y bwriad yma yw rhoi gwybod am fanylion sefydliad erbyn y dyddiad cau sef 11.59pm ar y dyddiad cau {0}. Gwiriwch eich bod yn rhoi gwybod ar gyfer y dyddiad cau cywir cyn ichi barhau.

source: File name
cy: Enw’r ffeil

source: Uploaded by
cy: Uwchlwythwyd gan

source: Re-upload members’ organisation details
cy: Ail-uwchlwytho manylion y sefydliad aelodau

source: Re-upload organisation details
cy: Ail-uwchlwytho manylion sefydliad

source: You have already uploaded your organisation details.
cy: Rydych chi eisoes wedi uwchlwytho manylion eich sefydliad.

source: You have already uploaded your members’ organisation details.
cy: Rydych chi eisoes wedi uwchlwytho manylion eich sefydliad aelodau.

# but_they_have_not_been_submitted
source: but they have not been submitted to the environmental regulator.
cy: ond maen nhw heb gael eu cyflwyno i’r rheoleiddiwr amgylcheddol.

# you_can_upload
source: You can upload this information again if something has changed. You don’t have permission to submit files.
cy: Gallwch uwchlwytho’r wybodaeth yma eto os bydd rhywbeth wedi newid. Does dim caniatâd gennych i gyflwyno ffeiliau.

# someone_in_your_team_with_the_right_account_permissions
source: Someone in your team with the right account permissions will need to submit this information to the environmental regulator.
cy: Bydd angen i rywun yn eich tîm sydd â’r caniatâd cywir yn y cyfrif gyflwyno’r wybodaeth yma i’r rheoleiddiwr amgylcheddol.

source: Are you sure you want to re-upload your organisation details?
cy: Ydych chi’n siŵr eich bod am ail-lwytho manylion eich sefydliad?

source: Re-upload members’ organisation details to submit to environmental regulator
cy: Ail-uwchlwytho manylion sefydliad aelodau i’w cyflwyno i’r rheoleiddiwr amgylcheddol

# you_already_submitted_your_members_organisation_details
source: You already submitted your members’ organisation details to the environmental regulator. You can upload and submit this information again if something has changed.
cy: Rydych chi eisoes wedi uwchlwytho manylion eich sefydliad aelodau i’r rheoleiddiwr amgylcheddol. Gallwch uwchlwytho’r wybodaeth yma eto os bydd rhywbeth wedi newid.

source: Date uploaded
cy: Dyddiad uwchlwytho

# submitted
source: Files you’ve already submitted
cy: Ffeiliau rydych chi eisoes wedi’u cyflwyno

# uploaded
source: Files you’ve uploaded and are replacing
cy: Ffeiliau rydych chi wedi’u huwchlwytho i fyny ac wrthi’n eu hamnewid

source: Continue
cy: Parhau

source: Cancel
cy: Canslo

# tab_title_organisation_details
source: Tell us if you want to re-upload your organisation details
cy: Dywedwch os hoffech chi ail-uwchlwytho manylion eich sefydliad

# tab_title_members_organisation_details
source: Tell us if you want to re-upload your members’ organisation details
cy: Dywedwch os hoffech chi ail-uwchlwytho manylion eich sefydliad aelodau

# your_organisation_already_submitted
source: Your organisation already submitted your members’ organisation details to the environmental regulator. You can upload this information again if something has changed. You don’t have permission to submit files.
cy: Mae eich sefydliad eisoes wedi uwchlwytho manylion eich sefydliad aelodau i’r rheoleiddiwr amgylcheddol. Gallwch uwchlwytho’r wybodaeth yma eto os bydd rhywbeth wedi newid. Does dim caniatâd gennych i gyflwyno ffeiliau.

source: Date submitted
cy: Dyddiad cyflwyno

source: Submitted by
cy: Cyflwynwyd gan

# detail_regarding_the_latest_file_submitted
source: Information about the last files submitted
cy: Gwybodaeth am y ffeiliau diwethaf a gyflwynwyd

# detail_regarding_the_latest_file_uploaded
source: Information about the file you’ve uploaded and can now submit
cy: Gwybodaeth am y ffeil rydych chi wedi’i huwchlwytho ac rydych chi’n cael ei chyflwyno nawr
